Revit 2026 API

# ExportLayerTable Class

---

A table supporting a mapping of category and subcategory to layer name and other layer properties that will be set in the target export format.

SystemObject Autodesk.Revit.DBExportLayerTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportLayerTable : IEnumerable<KeyValuePair<ExportLayerKey, ExportLayerInfo>>,
	IDisposable
```
```vb
Public Class ExportLayerTable
	Implements IEnumerable(Of KeyValuePair(Of ExportLayerKey, ExportLayerInfo)),
	IDisposable
```
```cpp
public ref class ExportLayerTable : IEnumerable<KeyValuePair<ExportLayerKey^, ExportLayerInfo^>>,
	IDisposable
```
```fsharp
type ExportLayerTable =
    class
        interface IEnumerable<KeyValuePair<ExportLayerKey, ExportLayerInfo>>
        interface IDisposable
    end
```

The ExportLayerTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportLayerTable | Constructs a new ExportLayerTable with default values. |

|  | Name | Description |
| --- | --- | --- |
|  | Count | Count of the items contained in the collection. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Item | A copy of the ExportLayerInfo item that corresponds to the layer's ExportLayerKey. |

|  | Name | Description |
| --- | --- | --- |
|  | Add | Inserts a (key,info) pair into Export layer table. |
|  | Clear | Removes all contents stored in the table. |
|  | ContainsKey | Checks whether a layer key exists in the table. |
|  | Dispose | Releases all resources used by the ExportLayerTable |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetAvaliableLayerModifierTypes | Gets all the avaliable layer modifier types for the layer key. |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetExportLayerInfo | Gets a copy of the layer info associated to the input pattern key. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetKeys | Gets all the keys stored in the map. |
|  | GetLayerTableIterator | Returns a LayerTableIterator that iterates through the collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | GetValues | Returns all the values stored in the map. |
|  | Remove | Removes the pair (key, info) by pattern key. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This table is structured as a mapping from ExportLayerKey to ExportLayerInfo members. The ExportLayerKey contains the identification information for the layer table: the Revit category and subcategory names. In addition, the key contains a SpecialType member used only to represent non-Revit categories that can be assigned specific layer information on export. The ExportLayerInfo contains the exported layer name, color name, and layer modifiers for standard and cut representations.

The table can be accessed via direct iteration as a collection of KeyValuePairs, or by traversal of the stored keys obtained from GetKeys(), or via specific lookup of a key constructed externally. In all cases, the ExportLayerInfo returned will be a copy of the ExportLayerInfo from the table. In order to make changes to the ExportLayerInfo and use those settings during export, set the modified ExportLayerInfo back into the table using the same key.

#### Reference

Autodesk.Revit.DB Namespace